{
  "materias": {
    "contabilidad-financiera": {
      "id": "contabilidad-financiera",
      "nombre": "Contabilidad Financiera",
      "descripcion": "Fundamentos y principios de la contabilidad financiera",
      "temas": {
        "estados-financieros": {
          "id": "estados-financieros",
          "nombre": "Estados Financieros",
          "introduccion": "Los estados financieros son documentos fundamentales que proporcionan información detallada sobre la situación económica y financiera de una empresa en un momento determinado. Estos informes permiten a los usuarios internos y externos evaluar la rentabilidad, liquidez, solvencia y eficiencia operativa de la organización. Los principales estados financieros incluyen el Balance General, el Estado de Resultados, el Estado de Flujos de Efectivo y el Estado de Cambios en el Patrimonio. Su correcta elaboración y análisis es esencial para la toma de decisiones estratégicas, la evaluación del desempeño empresarial y el cumplimiento de las obligaciones regulatorias. La interpretación adecuada de estos documentos permite identificar fortalezas, debilidades y oportunidades de mejora en la gestión financiera.",
          "preguntas": [
            {
              "id": 1,
              "pregunta": "¿Cuáles son los principales estados financieros básicos?",
              "opciones": [
                "Balance General",
                "Estado de Resultados",
                "Estado de Flujos de Efectivo",
                "Estado de Cambios en el Patrimonio"
              ],
              "respuestasCorrectas": [0, 1, 2, 3],
              "explicacion": "Los cuatro estados financieros básicos son fundamentales para evaluar la situación financiera de una empresa."
            },
            {
              "id": 2,
              "pregunta": "¿Qué muestra el Balance General?",
              "opciones": [
                "La situación financiera en un momento específico",
                "Los ingresos y gastos del período",
                "Los flujos de efectivo del período",
                "Las variaciones del patrimonio"
              ],
              "respuestasCorrectas": [0],
              "explicacion": "El Balance General presenta la situación financiera de la empresa en una fecha específica, mostrando activos, pasivos y patrimonio."
            }
          ],
          "saberMas": {
            "titulo": "Profundizando en los Estados Financieros",
            "contenido": "<h3>Componentes del Balance General</h3><p><strong>Activos:</strong> Recursos controlados por la empresa</p><ul><li>Activos Corrientes: Efectivo, cuentas por cobrar, inventarios</li><li>Activos No Corrientes: Propiedades, planta y equipo</li></ul><p><strong>Pasivos:</strong> Obligaciones de la empresa</p><ul><li>Pasivos Corrientes: Cuentas por pagar, deudas a corto plazo</li><li>Pasivos No Corrientes: Deudas a largo plazo</li></ul><p><strong>Patrimonio:</strong> Capital de los propietarios</p><p><strong>Ecuación Fundamental:</strong></p><p style='background-color: #f0f8ff; padding: 10px; border-radius: 5px; font-weight: bold;'>Activos = Pasivos + Patrimonio</p>"
          }
        },
        "principios-contables": {
          "id": "principios-contables",
          "nombre": "Principios Contables",
          "introduccion": "Los principios contables constituyen las bases conceptuales y normativas que rigen la preparación y presentación de la información financiera. Estos principios garantizan la uniformidad, comparabilidad y confiabilidad de los registros contables, proporcionando un marco común para la elaboración de estados financieros. Entre los principios fundamentales se encuentran el de devengado, que reconoce las transacciones cuando ocurren independientemente del momento del pago; el de empresa en funcionamiento, que asume la continuidad operativa; y el de consistencia, que requiere la aplicación uniforme de métodos contables. La aplicación correcta de estos principios es esencial para mantener la integridad de la información financiera y facilitar la toma de decisiones informadas por parte de inversores, acreedores y otros usuarios de los estados financieros.",
          "preguntas": [
            {
              "id": 1,
              "pregunta": "¿Cuáles son principios contables fundamentales?",
              "opciones": [
                "Principio de Devengado",
                "Principio de Empresa en Funcionamiento",
                "Principio de Consistencia",
                "Principio de Materialidad"
              ],
              "respuestasCorrectas": [0, 1, 2, 3],
              "explicacion": "Todos estos son principios contables fundamentales que guían la preparación de estados financieros."
            }
          ],
          "saberMas": {
            "titulo": "Principios Contables en Detalle",
            "contenido": "<h3>Principios Fundamentales</h3><p><strong>1. Principio de Devengado:</strong> Las transacciones se registran cuando ocurren, no cuando se paga</p><p><strong>2. Empresa en Funcionamiento:</strong> Se asume que la empresa continuará operando</p><p><strong>3. Consistencia:</strong> Métodos contables uniformes período tras período</p><p><strong>4. Materialidad:</strong> Se registran elementos que afectan significativamente las decisiones</p>"
          }
        }
      }
    },
    "analisis-economico-financiero": {
      "id": "analisis-economico-financiero",
      "nombre": "Análisis Económico-Financiero",
      "descripcion": "Técnicas y herramientas para el análisis de la situación financiera",
      "temas": {
        "ratios-financieros": {
          "id": "ratios-financieros",
          "nombre": "Ratios Financieros",
          "introduccion": "Los ratios financieros son herramientas analíticas fundamentales que permiten evaluar y comparar el desempeño financiero de una empresa mediante la relación entre diferentes cuentas de los estados financieros. Estos indicadores proporcionan una perspectiva cuantitativa sobre aspectos críticos como la liquidez, solvencia, rentabilidad y eficiencia operativa. El análisis de ratios facilita la identificación de tendencias, fortalezas y áreas de mejora, permitiendo a los analistas, inversores y gerentes tomar decisiones informadas. Entre los principales grupos de ratios se encuentran los de liquidez (que miden la capacidad de pago a corto plazo), los de solvencia (que evalúan la estructura de capital), los de rentabilidad (que analizan la generación de beneficios) y los de eficiencia (que miden la utilización de recursos). La interpretación adecuada de estos indicadores requiere considerar el contexto sectorial y las características específicas del negocio.",
          "preguntas": [
            {
              "id": 1,
              "pregunta": "¿Qué tipos de ratios financieros existen?",
              "opciones": [
                "Ratios de Liquidez",
                "Ratios de Solvencia",
                "Ratios de Rentabilidad",
                "Ratios de Eficiencia"
              ],
              "respuestasCorrectas": [0, 1, 2, 3],
              "explicacion": "Existen cuatro categorías principales de ratios financieros para evaluar diferentes aspectos del desempeño empresarial."
            },
            {
              "id": 2,
              "pregunta": "¿Qué mide el ratio de liquidez corriente?",
              "opciones": [
                "La capacidad de pago a corto plazo",
                "La rentabilidad de la empresa",
                "El nivel de endeudamiento",
                "La eficiencia operativa"
              ],
              "respuestasCorrectas": [0],
              "explicacion": "El ratio de liquidez corriente mide la capacidad de la empresa para cumplir con sus obligaciones a corto plazo."
            }
          ],
          "saberMas": {
            "titulo": "Fórmulas de Ratios Financieros",
            "contenido": "<h3>Ratios de Liquidez</h3><p><strong>Liquidez Corriente:</strong></p><p style='background-color: #f0f8ff; padding: 10px; border-radius: 5px;'>Activo Corriente / Pasivo Corriente</p><p><strong>Prueba Ácida:</strong></p><p style='background-color: #f0f8ff; padding: 10px; border-radius: 5px;'>(Activo Corriente - Inventarios) / Pasivo Corriente</p><h3>Ratios de Rentabilidad</h3><p><strong>ROE (Return on Equity):</strong></p><p style='background-color: #f0f8ff; padding: 10px; border-radius: 5px;'>Utilidad Neta / Patrimonio</p><p><strong>ROA (Return on Assets):</strong></p><p style='background-color: #f0f8ff; padding: 10px; border-radius: 5px;'>Utilidad Neta / Activos Totales</p>"
          }
        }
      }
    },
    "economia": {
      "id": "economia",
      "nombre": "Economía",
      "descripcion": "Principios fundamentales de la teoría económica",
      "temas": {
        "oferta-demanda": {
          "id": "oferta-demanda",
          "nombre": "Oferta y Demanda",
          "introduccion": "La ley de oferta y demanda constituye uno de los pilares fundamentales de la teoría económica moderna, explicando cómo se determinan los precios en una economía de mercado. Este mecanismo básico establece que el precio de un bien o servicio se determina por la interacción entre la cantidad que los consumidores están dispuestos a comprar (demanda) y la cantidad que los productores están dispuestos a ofrecer (oferta) a diferentes niveles de precios. La demanda generalmente tiene una relación inversa con el precio: cuando el precio aumenta, la cantidad demandada tiende a disminuir, y viceversa. Por el contrario, la oferta mantiene una relación directa con el precio: a mayor precio, mayor incentivo para producir y ofrecer el producto. El punto donde se cruzan las curvas de oferta y demanda se denomina equilibrio de mercado, determinando tanto el precio como la cantidad de equilibrio que se comercializará en condiciones normales.",
          "preguntas": [
            {
              "id": 1,
              "pregunta": "¿Qué factores afectan la demanda?",
              "opciones": [
                "Precio del bien",
                "Ingresos del consumidor",
                "Gustos y preferencias",
                "Precios de bienes sustitutos"
              ],
              "respuestasCorrectas": [0, 1, 2, 3],
              "explicacion": "Todos estos factores influyen en la cantidad demandada de un bien o servicio."
            },
            {
              "id": 2,
              "pregunta": "¿Qué ocurre cuando aumenta el precio de un bien?",
              "opciones": [
                "La cantidad demandada disminuye",
                "La cantidad ofrecida aumenta",
                "Ambas anteriores son correctas",
                "Ninguna de las anteriores"
              ],
              "respuestasCorrectas": [2],
              "explicacion": "Según las leyes de oferta y demanda, un aumento en el precio reduce la cantidad demandada pero aumenta la cantidad ofrecida."
            }
          ],
          "saberMas": {
            "titulo": "Análisis Profundo de Oferta y Demanda",
            "contenido": "<h3>Factores que Afectan la Demanda</h3><ul><li><strong>Precio del bien:</strong> Relación inversa</li><li><strong>Ingresos:</strong> Bienes normales vs inferiores</li><li><strong>Gustos:</strong> Cambios en preferencias</li><li><strong>Bienes relacionados:</strong> Sustitutos y complementarios</li><li><strong>Expectativas:</strong> Futuras variaciones de precio</li></ul><h3>Factores que Afectan la Oferta</h3><ul><li><strong>Costos de producción</strong></li><li><strong>Tecnología</strong></li><li><strong>Número de vendedores</strong></li><li><strong>Expectativas de precio</strong></li></ul>"
          }
        }
      }
    },
    "marketing": {
      "id": "marketing",
      "nombre": "Marketing",
      "descripcion": "Estrategias y conceptos fundamentales del marketing",
      "temas": {
        "mix-marketing": {
          "id": "mix-marketing",
          "nombre": "Mix de Marketing (4Ps)",
          "introduccion": "El Mix de Marketing, también conocido como las 4Ps, representa un marco estratégico fundamental que permite a las empresas desarrollar y ejecutar estrategias de marketing efectivas. Este concepto, desarrollado por Jerome McCarthy, integra cuatro elementos clave: Producto (Product), Precio (Price), Plaza o Distribución (Place) y Promoción (Promotion). Cada elemento debe ser cuidadosamente planificado y coordinado con los demás para crear una propuesta de valor coherente y atractiva para el mercado objetivo. El Producto abarca no solo las características físicas, sino también los beneficios, calidad, diseño y servicios asociados. El Precio debe reflejar el valor percibido y ser competitivo en el mercado. La Plaza se refiere a los canales de distribución y puntos de venta donde el consumidor puede acceder al producto. La Promoción incluye todas las actividades de comunicación para dar a conocer y persuadir sobre los beneficios del producto. La integración efectiva de estas variables determina el éxito de la estrategia de marketing.",
          "preguntas": [
            {
              "id": 1,
              "pregunta": "¿Cuáles son las 4Ps del Marketing?",
              "opciones": [
                "Producto",
                "Precio",
                "Plaza (Distribución)",
                "Promoción"
              ],
              "respuestasCorrectas": [0, 1, 2, 3],
              "explicacion": "Las 4Ps del marketing son los cuatro elementos fundamentales de cualquier estrategia de marketing."
            },
            {
              "id": 2,
              "pregunta": "¿Qué incluye la variable 'Producto'?",
              "opciones": [
                "Características físicas",
                "Calidad y diseño",
                "Servicios asociados",
                "Todas las anteriores"
              ],
              "respuestasCorrectas": [3],
              "explicacion": "La variable 'Producto' incluye todos los aspectos tangibles e intangibles que aportan valor al consumidor."
            }
          ],
          "saberMas": {
            "titulo": "Las 4Ps en Detalle",
            "contenido": "<h3>Producto</h3><p><strong>Núcleo:</strong> Beneficio básico que busca el consumidor</p><p><strong>Real:</strong> Características, calidad, diseño, marca</p><p><strong>Aumentado:</strong> Servicios adicionales, garantía, soporte</p><h3>Precio</h3><p><strong>Estrategias:</strong></p><ul><li>Penetración: Precio bajo inicial</li><li>Descremado: Precio alto inicial</li><li>Competitivo: Según competencia</li></ul><h3>Plaza</h3><p><strong>Canales:</strong> Directo, indirecto, mixto</p><p><strong>Cobertura:</strong> Intensiva, selectiva, exclusiva</p><h3>Promoción</h3><p><strong>Mix promocional:</strong> Publicidad, venta personal, promociones, relaciones públicas</p>"
          }
        }
      }
    }
  }
}